ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ЛогСобытий/чартер_ЛогСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_ЛогСобытий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.чартер_ТипСобытияЛога</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФункциональныйБлок</name>
    <type>
      <types>CatalogRef.чартер_ФункциональныеБлоки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ЛогСобытий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписьВЛог(СтруктураЗаписиЛога) Экспорт
	
	ЗаписьРС = СоздатьМенеджерЗаписи();
	ЗаписьРС.Период = СтруктураЗаписиЛога.Период;	
	ЗаписьРС.ТипСобытия = СтруктураЗаписиЛога.ТипСобытия;
	ЗаписьРС.ФункциональныйБлок = СтруктураЗаписиЛога.ФункциональныйБлок;
	ЗаписьРС.ОписаниеСобытия = СтруктураЗаписиЛога.ОписаниеСобытия;
	ЗаписьРС.Пользователь = SessionParameters.CurrentUser;
	
	Попытка
		ЗаписьРС.Записать();		
	Исключение    
		ОписаниеОшибки = ОписаниеОшибки();
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда           			
			чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(ОписаниеОшибки);	
		КонецЕсли;
	КонецПопытки;  
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
